TERRAFORM PLAN
| JOB                           |         STATUS               |
| ----------------------------- | ---------------------------- |
| 🖌 Terraform Format and Style |  success      |
| ⚙️ Terraform Initialization  |  success     |
| 🤖 Terraform Validation      |  success |
| 📖 Terraform Plan            |  success     |

<details><summary>Show Plan</summary>

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ++ create

Terraform will perform the following actions:

  ### aws_acm_certificate.api_certificate will be created
  ++ resource "aws_acm_certificate" "api_certificate" {
      ++ arn                       = (known after apply)
      ++ domain_name               = "workflow.test.com"
      ++ domain_validation_options = [
          ++ {
              ++ domain_name           = "workflow.test.com"
              ++ resource_record_name  = (known after apply)
              ++ resource_record_type  = (known after apply)
              ++ resource_record_value = (known after apply)
            },
        ]
      ++ id                        = (known after apply)
      ++ status                    = (known after apply)
      ++ subject_alternative_names = [
          ++ "workflow.test.com",
        ]
      ++ tags                      = {
          ++ "Description" = "certificates for dev test"
          ++ "Exposure"    = "Private"
          ++ "Name"        = "dev--terraform--workflow--test--test--certificates"
        }
      ++ tags_all                  = {
          ++ "Description" = "certificates for dev test"
          ++ "Exposure"    = "Private"
          ++ "Name"        = "dev--terraform--workflow--test--test--certificates"
        }
      ++ validation_emails         = (known after apply)
      ++ validation_method         = "DNS"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

�────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...
</details>